package com.ltqh.qh.entity;

import com.stx.xhb.xbanner.entity.SimpleBannerInfo;

import java.util.List;

public class BtcNewsEntity {


    @Override
    public String toString() {
        return "BtcNewsEntity{" +
                "code=" + code +
                ", msg='" + msg + '\'' +
                ", data=" + data +
                '}';
    }

    /**
     * code : 1
     * msg : success
     * data : [{"title":"央视再曝\u201c区块链诈骗\u201d：今年已关闭6家境内虚拟*交易平台","content":"12月10日，央视最新报道称，自2019年以来，已累计关闭6家新发现的境内虚拟*交易平台。相关部门目前已分7批通过技术处理203家境外虚拟*交易所，通过两家大型非银行支付机构关闭虚拟*账户近万个。在微信平台上，已关闭涉及宣传营销小程序与公众号300个。","share_content":"12月10日，央视最新报道称，自2019年以来，已累计关闭6家新发现的境内虚拟*交易平台。相关部门目前已分7批通过技术处理203家境外虚拟*交易所，通过两家大型非银行支付机构关闭虚拟*账户近万个。在微信平台上，已关闭涉及宣传营销小程序与公众号300个。","date":"2019-12-10 17:16:08","time":1575969368},{"title":"日经：高盛将为至少拥有5千*的个人用户提供数字资产管理服务","content":"据日经新闻报道，从2020年开始，高盛将向至少拥有5000*资金的个人提供数字资产管理服务。","share_content":"据日经新闻报道，从2020年开始，高盛将向至少拥有5000*资金的个人提供数字资产管理服务。","date":"2019-12-10 16:58:34","time":1575968314},{"title":"观点：大部分项目被高估，加密*投资正经历范式转移","content":"12月10日，在\u201c2019区块链创新应用与数字经济论坛，暨新加坡杭州科技园国际区块链中心发布会\u201d的圆桌环节。OutlierVentures创始合伙人JamieBurke在回答为什么存在价值洼地时称，上一阶段，待币的价值由投资决定。下一阶段，代币的价值将取决于开发者的需求，市场正在发生范式转换。注意力资本合伙人程巍也认为，市场好时始终有人买单，项目都很贵。投机市场里公众对技术缺乏了解，而类型、地区差异都会造成估值差异。而随着范式转移，为实体带来服务并以此收费的项目逐步落地，估值体系就会更接近传统的估值体系。几乎所有嘉宾都认为，目前大部分项目被高估了。SNZCEO池豪特别强调，此前有一批项目宣称对标以太坊，而随着项目落地，这些项目承诺的百万TPS并没有实现，以太坊的问题它们也没有好的解决方案。","share_content":"12月10日，在\u201c2019区块链创新应用与数字经济论坛，暨新加坡杭州科技园国际区块链中心发布会\u201d的圆桌环节。Outlier Ventures 创始合伙人 Jamie Burke在回答为什么存在价值洼地时称，上一阶段，待币的价值由投资决定。下一阶段，代币的价值将取决于开发者的需求，市场正在发生范式转换。注意力资本合伙人程巍也认为，市场好时始终有人买单，项目都很贵。投机市场里公众对技术缺乏了解，而类型、地区差异都会造成估值差异。而随着范式转移，为实体带来服务并以此收费的项目逐步落地，估值体系就会更接近传统的估值体系。几乎所有嘉宾都认为，目前大部分项目被高估了。SNZ CEO池豪特别强调，此前有一批项目宣称对标以太坊，而随着项目落地，这些项目承诺的百万TPS并没有实现，以太坊的问题它们也没有好的解决方案。","date":"2019-12-10 16:36:45","time":1575967005},{"title":"阿里巴巴成为杭州亚运会官方合作伙伴，蚂蚁区块链技术将深度参与杭州亚运会","content":"巴比特讯，12月10日，杭州2022年第19届亚运会组委会宣布，阿里巴巴成为杭州亚运会官方合作伙伴。作为创新技术，蚂蚁区块链技术将深度参与杭州亚运会，全程应用在这一国际赛事中，包括交通出行、签约协议、文化版权、票务及纪念品销售等。在现场，杭州亚组委和阿里巴巴还通过蚂蚁金服区块链可信存证技术签约，为大型综合国际赛事首创。","share_content":"巴比特讯，12月10日，杭州2022年第19届亚运会组委会宣布，阿里巴巴成为杭州亚运会官方合作伙伴。作为创新技术，蚂蚁区块链技术将深度参与杭州亚运会，全程应用在这一国际赛事中，包括交通出行、签约协议、文化版权、票务及纪念品销售等。在现场，杭州亚组委和阿里巴巴还通过蚂蚁金服区块链可信存证技术签约，为大型综合国际赛事首创。","date":"2019-12-10 16:28:35","time":1575966515},{"title":"中国并购公会创始会长王巍：区块链不仅是技术革命，更是一场观念革命","content":"中国并购公会创始会长、中国金融博物馆理事长王巍表示，区块链不仅是一场技术革命，更重要的是一场观念革命。互联网诞生之初很多人并不看好，但如今它已经深刻改变人们的日常生活。今天，很多人对区块链没有具体概念，但不能忽视它的未来影响。在区块链的颠覆性应用中，尽管不断谈到不用区块链依旧可以溯源，不用区块链依旧可以认证，但是，我们用区块链的方式会开拓一个更深入的层面，会形成一个不可篡改的、可以互相耦合的自组织的、不一样的场景，所以大家在尝试。","share_content":"中国并购公会创始会长、中国金融博物馆理事长王巍表示，区块链不仅是一场技术革命，更重要的是一场观念革命。互联网诞生之初很多人并不看好，但如今它已经深刻改变人们的日常生活。今天，很多人对区块链没有具体概念，但不能忽视它的未来影响。在区块链的颠覆性应用中，尽管不断谈到不用区块链依旧可以溯源，不用区块链依旧可以认证，但是，我们用区块链的方式会开拓一个更深入的层面，会形成一个不可篡改的、可以互相耦合的自组织的、不一样的场景，所以大家在尝试。","date":"2019-12-10 16:17:15","time":1575965835},{"title":"澳交所执行总经理：长期以来的声誉是澳交所在BaaS市场的竞争优势","content":"澳大利亚证券交易所（ASX）明年年中将完成其区块链平台的建设，以取代其现行的CHESS系统时，该平台的完成也将标志着澳交所作为区块链服务提供商的商业业务的启动。澳交所执行总经理CliffRichards表示：\u201c我们正在进入一个竞争激烈的领域。这将是澳大利亚证券交易所与IBM、微软和其他提供区块链即服务（BaaS）的大型科技公司之间的竞争。\u201dRichards称：\u201c我们自认为能够提供更好的价值。市场长期以来对澳交所的信任\u2014\u2014相信它不会做\u2018任何狡猾的事情\u2019\u2014\u2014将赋予其竞争优势。\u201d","share_content":"澳大利亚证券交易所（ASX）明年年中将完成其区块链平台的建设，以取代其现行的CHESS系统时，该平台的完成也将标志着澳交所作为区块链服务提供商的商业业务的启动。澳交所执行总经理Cliff Richards表示：\u201c我们正在进入一个竞争激烈的领域。这将是澳大利亚证券交易所与IBM、微软和其他提供区块链即服务（BaaS）的大型科技公司之间的竞争。\u201dRichards称：\u201c我们自认为能够提供更好的价值。市场长期以来对澳交所的信任\u2014\u2014相信它不会做\u2018任何狡猾的事情\u2019\u2014\u2014将赋予其竞争优势。\u201d","date":"2019-12-10 16:16:33","time":1575965793},{"title":"中国联通网研院唐雄燕：联通BaaS还在试点阶段，未来将从\u201c5G 区块链\u201d迈向\u201c5G×区块链\u201d","content":"中国联通网研院首席科学家唐雄燕在接受C114采访时指出，中国联通推出的BaaS（区块链即服务）还处于试点阶段，相比于区块链领先服务商的步伐似乎慢半拍。但这并不是问题，因为区块链在电信领域的研究和应用还停留在探索期，处于初级阶段。唐雄燕相信，随着5G、AI、IoT、大数据等技术的不断发展，万物智联时代正加速到来。区块链与这些新兴ICT（信息、通信和技术）技术的深度融合，使其与通信行业的关系将从相\u201c\u201d变成相乘\u201c×\u201d，应用也将加速落地。","share_content":"中国联通网研院首席科学家唐雄燕在接受C114采访时指出，中国联通推出的BaaS（区块链即服务）还处于试点阶段，相比于区块链领先服务商的步伐似乎慢半拍。但这并不是问题，因为区块链在电信领域的研究和应用还停留在探索期，处于初级阶段。唐雄燕相信，随着5G、AI、IoT、大数据等技术的不断发展，万物智联时代正加速到来。区块链与这些新兴ICT（信息、通信和技术）技术的深度融合，使其与通信行业的关系将从相\u201c \u201d变成相乘\u201c×\u201d，应用也将加速落地。","date":"2019-12-10 16:07:49","time":1575965269},{"title":"中国宝武正在布局产业区块链领域","content":"中国宝武旗下产业互联网平台公司欧冶云商相关负责人10日表示，区块链的产业化发展正在蓬勃兴起，中国宝武的相关技术创新与产业实践也从局部试验进入到全面发展的关键阶段。欧冶金服通宝产品近期已获国家互联网信息办公室备案通过，为业务后续的合规发展奠定了基础。","share_content":"中国宝武旗下产业互联网平台公司欧冶云商相关负责人10日表示，区块链的产业化发展正在蓬勃兴起，中国宝武的相关技术创新与产业实践也从局部试验进入到全面发展的关键阶段。欧冶金服通宝产品近期已获国家互联网信息办公室备案通过，为业务后续的合规发展奠定了基础。","date":"2019-12-10 15:59:57","time":1575964797},{"title":"Tether由比特币网络向以太坊网络的2亿枚USDT切换基本完成","content":"北京链安ChainsMap链上监测系统发现，北京时间下午15:34分，TetherTreasury在以太坊网络上向币安交易所转账约2亿枚（200,000,010）枚USDT，此前，Tether（USDT）已经公告将进行比特币OMNIUSDT向以太坊网络2亿枚USDT的切换，并在昨日率先在以太坊上增发2亿枚USDT。而今日12:27分，在比特币网络上，币安交易所向TetherTreasury转入2亿枚OMNIUSDT。经过以上操作，本次切换基本完成，接下来，最后还需等待TetherTreasury在比特币网络将2亿枚OMNIUSDT转入32TLn1开头地址，执行RevokePropertyTokens命令销毁，才算完成整个无总量增发的切换。","share_content":"北京链安ChainsMap链上监测系统发现，北京时间下午15:34分，Tether Treasury在以太坊网络上向币安交易所转账约2亿枚（200,000,010）枚USDT，此前，Tether（USDT）已经公告将进行比特币OMNI USDT向以太坊网络2亿枚USDT的切换，并在昨日率先在以太坊上增发2亿枚USDT。而今日12:27分，在比特币网络上，币安交易所向Tether Treasury转入2亿枚OMNI USDT。经过以上操作，本次切换基本完成，接下来，最后还需等待Tether Treasury在比特币网络将2亿枚OMNI USDT转入32TLn1开头地址，执行Revoke Property Tokens命令销毁，才算完成整个无总量增发的切换。","date":"2019-12-10 15:51:37","time":1575964297},{"title":"成都链安推出Beosin-AML虚拟资产调查取证和反洗钱合规系统","content":"成都链安科技今日推出了可视化的虚拟资产合规监测和调查取证分析系统Beosin-AML，旨在帮助虚拟资产服务商（VASP）监测交易风险、执行反洗钱合规程序，帮助监管部门监督VASP合规流程执行情况，帮助执法部门快速收集虚拟资产犯罪案件证据，为受害者提供技术协助。系统的一大亮点是，上线技术援助服务，受害者被盗币或不慎参与了跑路盘、资金盘等非法项目后，可在网站提交相关信息，平台开展调查、分析和追踪等取证服务。链接：https://beosin.com/aml/index.html#/index","share_content":"成都链安科技今日推出了可视化的虚拟资产合规监测和调查取证分析系统Beosin-AML，旨在帮助虚拟资产服务商（VASP）监测交易风险、执行反洗钱合规程序，帮助监管部门监督VASP合规流程执行情况，帮助执法部门快速收集虚拟资产犯罪案件证据，为受害者提供技术协助。系统的一大亮点是，上线技术援助服务，受害者被盗币或不慎参与了跑路盘、资金盘等非法项目后，可在网站提交相关信息，平台开展调查、分析和追踪等取证服务。链接：https://beosin.com/aml/index.html#/index","date":"2019-12-10 15:46:30","time":1575963990}]
     */



    private int code;
    private String msg;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean extends SimpleBannerInfo {
        /**
         * title : 央视再曝“区块链诈骗”：今年已关闭6家境内虚拟*交易平台
         * content : 12月10日，央视最新报道称，自2019年以来，已累计关闭6家新发现的境内虚拟*交易平台。相关部门目前已分7批通过技术处理203家境外虚拟*交易所，通过两家大型非银行支付机构关闭虚拟*账户近万个。在微信平台上，已关闭涉及宣传营销小程序与公众号300个。
         * share_content : 12月10日，央视最新报道称，自2019年以来，已累计关闭6家新发现的境内虚拟*交易平台。相关部门目前已分7批通过技术处理203家境外虚拟*交易所，通过两家大型非银行支付机构关闭虚拟*账户近万个。在微信平台上，已关闭涉及宣传营销小程序与公众号300个。
         * date : 2019-12-10 17:16:08
         * time : 1575969368
         */

        private String title;
        private String content;
        private String share_content;
        private String date;
        private int time;

        @Override
        public String toString() {
            return "DataBean{" +
                    "title='" + title + '\'' +
                    ", content='" + content + '\'' +
                    ", share_content='" + share_content + '\'' +
                    ", date='" + date + '\'' +
                    ", time=" + time +
                    '}';
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getShare_content() {
            return share_content;
        }

        public void setShare_content(String share_content) {
            this.share_content = share_content;
        }

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }

        public int getTime() {
            return time;
        }

        public void setTime(int time) {
            this.time = time;
        }

        @Override
        public Object getXBannerUrl() {
            return null;
        }
    }
}
